Initializing gui preferences from file  /rsghome/greatmd/.synopsys_icc_prefs.tcl
icc_shell> sh date
Fri Jan 10 21:28:07 PST 2014
icc_shell> sh hostname
rsg1.stanford.edu
icc_shell> sh uptime
 21:28:07 up 1 day,  6:14,  4 users,  load average: 0.02, 0.15, 0.22
icc_shell> remove_design -all
1
icc_shell> set dv_root [sh echo \$DV_ROOT]
/rsgs/file0/greatmd/david/abl/OST2/OST2.design
icc_shell> set syn_home [sh echo \$SYN_LIB]
/cad/synopsys/dc_shell/G-2012.06-SP5-1/libraries/syn
icc_shell> 
icc_shell> ## goto spc directory:
icc_shell> set block  spc
spc
icc_shell> set blk_dir $dv_root/design/sys/iop/$block/synopsys
/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys
icc_shell> echo "PNR target module" $block
PNR target module spc
icc_shell> echo "Enter $blk_dir"
Enter /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys
icc_shell> cd $blk_dir
icc_shell> 
icc_shell> ## create pnr directory
icc_shell> #sh mkdir pnr
icc_shell> cd pnr
icc_shell> 
icc_shell> set top_module spc
spc
icc_shell> #########################################################################
icc_shell> ## Library Prepraation
icc_shell> ## 1. setup for logical and physical library
icc_shell> ## 2. load tlu_plus file => this is from Syonpsys EDK (TODO: not accurate)
icc_shell> ## 3. checking library/tlu consistancy
icc_shell> #########################################################################
icc_shell> source -echo -verbose $dv_root/design/sys/synopsys/script/pnr_lib_setup.tcl
#########################################################################
## Library Prepraation
## 1. setup for logical and physical library
## 2. load tlu_plus file => this is from Syonpsys EDK (TODO: not accurate)
## 3. checking library/tlu consistancy 
#########################################################################
source -echo -verbose $dv_root/design/sys/synopsys/script/target_lib.scr
# ========== Copyright Header Begin ==========================================
# 
# OpenSPARC T2 Processor File: target_lib.scr
# Copyright (C) 1995-2007 Sun Microsystems, Inc. All Rights Reserved
# 4150 Network Circle, Santa Clara, California 95054, U.S.A.
#
# * DO NOT ALTER OR REMOVE COPYRIGHT NOTICES OR THIS FILE HEADER. 
#
# This program is free software; you can redistribute it and/or modify
# it under the terms of the GNU General Public License as published by
# the Free Software Foundation; version 2 of the License.
#
# This program is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
# GNU General Public License for more details.
#
# You should have received a copy of the GNU General Public License
# along with this program; if not, write to the Free Software
# Foundation, Inc., 59 Temple Place, Suite 330, Boston, MA  02111-1307  USA
#
# For the avoidance of doubt, and except that if any non-GPL license 
# choice is available it will apply instead, Sun elects to use only 
# the General Public License version 2 (GPLv2) at this time for any 
# software where a choice of GPL license versions is made 
# available with the language indicating that GPLv2 or any later version 
# may be used, or where a choice of which version of the GPL is applied is 
# otherwise unspecified. 
#
# Please contact Sun Microsystems, Inc., 4150 Network Circle, Santa Clara, 
# CA 95054 USA or visit www.sun.com if you need additional information or 
# have any questions. 
# 
# ========== Copyright Header End ============================================
echo "INFO: target library version $syn_home"
INFO: target library version /cad/synopsys/dc_shell/G-2012.06-SP5-1/libraries/syn
set gate_lib_file tcbn28hpmbwp35tt1v25c_ccs.db
tcbn28hpmbwp35tt1v25c_ccs.db
set link_library $gate_lib_file
tcbn28hpmbwp35tt1v25c_ccs.db
set target_library $gate_lib_file 
tcbn28hpmbwp35tt1v25c_ccs.db
set lib_dir_md /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10
/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10
set std_lib_dir_md $lib_dir_md/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a
/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a
#set wire_library_file   {lsi_10k.db}
#set wire_library   lsi_10k
#set wire_model_name      05x05
#set wireload_mode      top
set search_path [concat $search_path $syn_home $std_lib_dir_md $dv_root/design/sys/iop/spc/synopsys/bb/qtm/]
. /cad/synopsys/icc/2011.09-SP1/libraries/syn /cad/synopsys/icc/2011.09-SP1/minpower/syn /cad/synopsys/icc/2011.09-SP1/dw/syn_ver /cad/synopsys/icc/2011.09-SP1/dw/sim_ver /cad/synopsys/dc_shell/G-2012.06-SP5-1/libraries/syn /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/
set link_library [concat * $link_library ]
* tcbn28hpmbwp35tt1v25c_ccs.db
#set_min_library tcbn28hpmbwp35tt1v25c_ccs.db -min_version tcbn28hpmbwp35ff0p99v0c_ccs.db 
set symbol_library {}
set dont_use_cells 1
1
set dont_use_cell_list {}
## Donguk : following is added for PNR 
#lappend link_library "n2_frf_mp_256x78_cust.db"
# .tf file 
set technology_file $lib_dir_md/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28.tf
/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28.tf
# reference library
set mw_reference_library [concat   $lib_dir_md/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28   ]
/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28
#TLU+ Files
set max_tluplus $dv_root/pnr_lib/1p9m.tluplus
/rsgs/file0/greatmd/david/abl/OST2/OST2.design/pnr_lib/1p9m.tluplus
set min_tluplus $dv_root/pnr_lib/1p9m.tluplus
/rsgs/file0/greatmd/david/abl/OST2/OST2.design/pnr_lib/1p9m.tluplus
#set max_tluplus $lib_dir_md/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/techfiles/starrc/1p9m.tluplus
#set min_tluplus $lib_dir_md/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/techfiles/starrc/1p9m.tluplus
## Delete previous milkyway db
#if {[file exists mw_lib]} {
#  sh rm -rf mw_lib
#}
#  create_mw_lib mw_lib -technology $technology_file -mw_reference_library $mw_reference_library
open_mw_lib mw_lib
{mw_lib}
#TODO: might need tech2itf map file
set_tlu_plus_files  -max_tluplus $max_tluplus -min_tluplus $min_tluplus    
Information: No layer mapping file is specified. Assume layer names are the same between the technology library and the ITF. (RCEX-071)
1
check_library
Loading db file '/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a/tcbn28hpmbwp35tt1v25c_ccs.db'
Information: Using CCS timing libraries. (TIM-024)

#BEGIN_XCHECK_LIBRARY

Logic Library:    tcbn28hpmbwp35tt1v25c_ccs 
Physical Library: /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28 
check_library options:  
Version:                                F-2011.09-ICC-SP1
Check date and time:    Fri Jan 10 21:28:13 2014

          List of logic library and file names
------------------------------------------------------------------------------
Logic library name           Logic library file name
------------------------------------------------------------------------------
tcbn28hpmbwp35tt1v25c_ccs    /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a/tcbn28hpmbwp35tt1v25c_ccs.db
------------------------------------------------------------------------------

#BEGIN_XCHECK_LOGICCELLS

Number of cells missing in logic library:       41 (out of 1303)

Information: List of cells missing in logic library (LIBCHK-210)
-------------------------------------------------------------------------
Cell name                  Cell type             Physical library
-------------------------------------------------------------------------
LVLHLCLOD2BWP35            Core                  tsmc28
LVLHLCLOD4BWP35            Core                  tsmc28
LVLHLCLOD8BWP35            Core                  tsmc28
LVLHLD1BWP35               Core                  tsmc28
LVLHLD2BWP35               Core                  tsmc28
LVLHLD4BWP35               Core                  tsmc28
LVLHLD8BWP35               Core                  tsmc28
LVLLHCD1BWP35              Core                  tsmc28
LVLLHCD2BWP35              Core                  tsmc28
LVLLHCD4BWP35              Core                  tsmc28
LVLLHCD8BWP35              Core                  tsmc28
LVLLHCLOD1BWP35            Core                  tsmc28
LVLLHCLOD2BWP35            Core                  tsmc28
LVLLHCLOD4BWP35            Core                  tsmc28
LVLLHCLOD8BWP35            Core                  tsmc28
LVLLHD1BWP35               Core                  tsmc28
LVLLHD2BWP35               Core                  tsmc28
LVLLHD4BWP35               Core                  tsmc28
LVLLHD8BWP35               Core                  tsmc28
LVLHLCD1BWP35              Core                  tsmc28
LVLHLCD2BWP35              Core                  tsmc28
LVLHLCD4BWP35              Core                  tsmc28
LVLHLCD8BWP35              Core                  tsmc28
LVLHLCLOD1BWP35            Core                  tsmc28
ISOHID1BWP35               Core                  tsmc28
ISOHID2BWP35               Core                  tsmc28
ISOHID4BWP35               Core                  tsmc28
ISOHID8BWP35               Core                  tsmc28
ISOLOD1BWP35               Core                  tsmc28
ISOLOD2BWP35               Core                  tsmc28
ISOLOD4BWP35               Core                  tsmc28
ISOLOD8BWP35               Core                  tsmc28
TS6N28HPMA256X32M2SWBSO    Unknown               tsmc28
TS6N28HPMA64X32M2SWBSO     Unknown               tsmc28
TS1N28HPMB256X32M4SWBASO   Unknown               tsmc28
TS1N28HPMB64X32M4SWBASO    Unknown               tsmc28
TSDN28HPMA64X32M4F         Unknown               tsmc28
TS6N28HPMA64X32M2F         Unknown               tsmc28
TS1N28HPMB256X32M4S        Unknown               tsmc28
TS6N28HPMA40X32M2F         Unknown               tsmc28
TS1N28HPMB64X26M4S         Unknown               tsmc28
-------------------------------------------------------------------------

Information: List of physical only cells (LIBCHK-119)
-------------------------------------------------------------------------
Cell name                  Cell type             Physical library
-------------------------------------------------------------------------
TAPCELLBWP35               PGPinOnly             tsmc28
FILL3BWP35                 PGPinOnly             tsmc28
FILL4BWP35                 PGPinOnly             tsmc28
FILL64BWP35                PGPinOnly             tsmc28
FILL8BWP35                 PGPinOnly             tsmc28
FILL16BWP35                PGPinOnly             tsmc28
FILL2BWP35                 PGPinOnly             tsmc28
FILL32BWP35                PGPinOnly             tsmc28
BOUNDARY_LEFTBWP35         PGPinOnly             tsmc28
BOUNDARY_RIGHTBWP35        PGPinOnly             tsmc28
-------------------------------------------------------------------------

#END_XCHECK_LOGICCELLS

#BEGIN_XCHECK_PHYSICALCELLS

Number of cells missing in physical library:    0 (out of 1354)

#END_XCHECK_PHYSICALCELLS

#BEGIN_XCHECK_PINS

Number of cells with missing or mismatched pins in libraries:   0

#END_XCHECK_PINS

Logic vs. physical library check summary:
Number of cells missing in logic library:       41 
Information: Logic library is INCONSISTENT with physical library (LIBCHK-220)

#END_XCHECK_LIBRARY

/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28
0
check_tlu_plus_files

Sanity check for TLU+ vs MW-Tech files:
 max_tlu+: /rsgs/file0/greatmd/david/abl/OST2/OST2.design/pnr_lib/1p9m.tluplus
 min_tlu+: /rsgs/file0/greatmd/david/abl/OST2/OST2.design/pnr_lib/1p9m.tluplus
 mapping_file: default
 max_emul_tlu+: **NONE**
 min_emul_tlu+: **NONE**
 MW design lib: mw_lib

--------- Sanity Check on TLUPlus Files -------------
1. Checking the conducting layer names in ITF and mapping file ... 
[ Passed! ]
2. Checking the via layer names in ITF and mapping file ... 
[ Passed! ]
3. Checking the consistency of Min Width and Min Spacing between MW-tech and ITF ... 
[ Passed! ]
----------------- Check Ends ------------------
1
1
icc_shell> 
icc_shell> set bbs {n2_frf_mp_256x78_cust n2_com_dp_32x84_cust n2_com_dp_32x72_cust n2_dca_sp_9kb_cust n2_dva_dp_32x32_cust n2_com_dp_32x152_cust n2_stb_cm_64x45_cust n2_com_dp_64x84_cust n2_dta_sp_1920b_cust n2_tlb_tl_128x59_cust n2_irf_mp_128x72_cust n2_icd_sp_16p5kb_cust n2_ict_sp_1920b_cust n2_tlb_tl_64x59_cust}
n2_frf_mp_256x78_cust n2_com_dp_32x84_cust n2_com_dp_32x72_cust n2_dca_sp_9kb_cust n2_dva_dp_32x32_cust n2_com_dp_32x152_cust n2_stb_cm_64x45_cust n2_com_dp_64x84_cust n2_dta_sp_1920b_cust n2_tlb_tl_128x59_cust n2_irf_mp_128x72_cust n2_icd_sp_16p5kb_cust n2_ict_sp_1920b_cust n2_tlb_tl_64x59_cust
icc_shell> 
icc_shell> foreach bb_each $bbs {
lappend link_library "$bb_each.db"
echo "$bb_each.db"
#set_dont_touch $bb_each
}
n2_frf_mp_256x78_cust.db
n2_com_dp_32x84_cust.db
n2_com_dp_32x72_cust.db
n2_dca_sp_9kb_cust.db
n2_dva_dp_32x32_cust.db
n2_com_dp_32x152_cust.db
n2_stb_cm_64x45_cust.db
n2_com_dp_64x84_cust.db
n2_dta_sp_1920b_cust.db
n2_tlb_tl_128x59_cust.db
n2_irf_mp_128x72_cust.db
n2_icd_sp_16p5kb_cust.db
n2_ict_sp_1920b_cust.db
n2_tlb_tl_64x59_cust.db
icc_shell> 
icc_shell> #########################################################################
icc_shell> ## Loading synthesized netlist and .sdc for SPC
icc_shell> #########################################################################
icc_shell> #source -echo -verbose $dv_root/design/sys/synopsys/script/pnr_spc_netlist.tcl
icc_shell> read_verilog -dirty_netlist ../gate/spc_all.vSyn
Loading db file '/rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a/tcbn28hpmbwp35tt1v25c_ccs.db'
Warning: Conflict unit found: MW tech file power unit is mW; Main Library power unit is nW. (IFS-007)
Type of creating bus for undefined cells : 0

*****  Verilog HDL translation! *****

*****    Start Pass 1 *****
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_frf_mp_256x78_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x84_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x72_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dca_sp_9kb_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dva_dp_32x32_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x152_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_stb_cm_64x45_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_64x84_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dta_sp_1920b_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_128x59_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_irf_mp_128x72_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_icd_sp_16p5kb_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_ict_sp_1920b_cust.db'
Loading db file '/rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_64x59_cust.db'

*****  Pass 1 Complete *****
Elapsed =    0:00:07, CPU =    0:00:06

*****  Verilog HDL translation! *****

*****    Start Pass 2 *****
Warning: Cell 'spu.CEL' is created for undefined module 'spu'. (MWNL-294)
      port "in_rngl_cdbus" is a bus, created as [64:0]
      port "spu_rngl_cdbus" is a bus, created as [64:0]
Warning: Cell 'n2_frf_mp_256x78_cust.CEL' is created for undefined module 'n2_frf_mp_256x78_cust'. (MWNL-294)
      port "frf_r1_data" is a bus, created as [63:0]
      port "frf_r1_ecc" is a bus, created as [13:0]
      port "frf_r2_data" is a bus, created as [63:0]
      port "frf_r2_ecc" is a bus, created as [13:0]
      port "r_tid" is a bus, created as [2:0]
      port "r1_addr" is a bus, created as [4:0]
      port "r2_addr" is a bus, created as [4:0]
      port "w1_tid" is a bus, created as [2:0]
      port "w1_valid" is a bus, created as [1:0]
      port "w1_addr" is a bus, created as [4:0]
      port "w2_tid" is a bus, created as [2:0]
      port "w2_valid" is a bus, created as [1:0]
      port "w2_addr" is a bus, created as [4:0]
      port "w1_data" is a bus, created as [63:0]
      port "w1_ecc" is a bus, created as [13:0]
      port "w2_data" is a bus, created as [63:0]
      port "w2_ecc" is a bus, created as [13:0]
Warning: Cell 'n2_com_dp_32x84_cust.CEL' is created for undefined module 'n2_com_dp_32x84_cust'. (MWNL-294)
      port "wr_adr" is a bus, created as [4:0]
      port "rd_adr" is a bus, created as [4:0]
      port "din" is a bus, created as [83:0]
      port "dout" is a bus, created as [83:0]
Warning: Cell 'n2_com_dp_32x72_cust.CEL' is created for undefined module 'n2_com_dp_32x72_cust'. (MWNL-294)
      port "wr_adr" is a bus, created as [4:0]
      port "rd_adr" is a bus, created as [4:0]
      port "din" is a bus, created as [71:0]
      port "dout" is a bus, created as [71:0]
Warning: Cell 'n2_dca_sp_9kb_cust.CEL' is created for undefined module 'n2_dca_sp_9kb_cust'. (MWNL-294)
      port "dcache_rd_addr_e" is a bus, created as [7:0]
      port "dcache_alt_addr_e" is a bus, created as [7:0]
      port "dcache_wdata_e" is a bus, created as [143:0]
      port "dcache_wr_way_e" is a bus, created as [1:0]
      port "dcache_byte_wr_en_e" is a bus, created as [15:0]
      port "dcache_alt_rsel_way_m" is a bus, created as [3:0]
      port "dcache_rsel_way_b" is a bus, created as [3:0]
      port "lsu_l2fill_or_byp_data_m" is a bus, created as [63:0]
      port "dcache_rdata_b" is a bus, created as [63:0]
      port "dcache_rparity_b" is a bus, created as [7:0]
      port "dcache_rdata_msb_w0_b" is a bus, created as [7:0]
      port "dcache_rdata_msb_w1_b" is a bus, created as [7:0]
      port "dcache_rdata_msb_w2_b" is a bus, created as [7:0]
      port "dcache_rdata_msb_w3_b" is a bus, created as [7:0]
      port "fuse_dca_repair_value" is a bus, created as [5:0]
      port "fuse_dca_repair_en" is a bus, created as [1:0]
      port "fuse_dca_rid" is a bus, created as [1:0]
      port "dca_fuse_repair_value" is a bus, created as [5:0]
      port "dca_fuse_repair_en" is a bus, created as [1:0]
Warning: Cell 'n2_dva_dp_32x32_cust.CEL' is created for undefined module 'n2_dva_dp_32x32_cust'. (MWNL-294)
      port "rd_addr" is a bus, created as [4:0]
      port "wr_addr" is a bus, created as [4:0]
      port "din" is a bus, created as [31:0]
      port "bit_wen" is a bus, created as [31:0]
      port "dout" is a bus, created as [31:0]
Warning: Cell 'n2_com_dp_32x152_cust.CEL' is created for undefined module 'n2_com_dp_32x152_cust'. (MWNL-294)
      port "wr_adr" is a bus, created as [4:0]
      port "rd_adr" is a bus, created as [4:0]
      port "din" is a bus, created as [151:0]
      port "dout" is a bus, created as [151:0]
Warning: Cell 'n2_stb_cm_64x45_cust.CEL' is created for undefined module 'n2_stb_cm_64x45_cust'. (MWNL-294)
      port "stb_cam_rw_ptr" is a bus, created as [2:0]
      port "stb_cam_rw_tid" is a bus, created as [2:0]
      port "stb_camwr_data" is a bus, created as [44:0]
      port "stb_cam_cm_tid" is a bus, created as [2:0]
      port "stb_cam_line_en" is a bus, created as [7:0]
      port "stb_rdata_ramc" is a bus, created as [44:0]
      port "stb_cam_hit_ptr" is a bus, created as [2:0]
Warning: Cell 'n2_com_dp_64x84_cust.CEL' is created for undefined module 'n2_com_dp_64x84_cust'. (MWNL-294)
      port "wr_adr" is a bus, created as [5:0]
      port "rd_adr" is a bus, created as [5:0]
      port "din" is a bus, created as [83:0]
      port "dout" is a bus, created as [83:0]
Warning: Cell 'n2_dta_sp_1920b_cust.CEL' is created for undefined module 'n2_dta_sp_1920b_cust'. (MWNL-294)
      port "index0_x" is a bus, created as [6:0]
      port "index1_x" is a bus, created as [6:0]
      port "wrway_x" is a bus, created as [1:0]
      port "wrtag_x" is a bus, created as [29:0]
      port "rdtag_w0_y" is a bus, created as [29:0]
      port "rdtag_w1_y" is a bus, created as [29:0]
      port "rdtag_w2_y" is a bus, created as [29:0]
      port "rdtag_w3_y" is a bus, created as [29:0]
Warning: Cell 'n2_tlb_tl_128x59_cust.CEL' is created for undefined module 'n2_tlb_tl_128x59_cust'. (MWNL-294)
      port "tlb_rw_index" is a bus, created as [6:0]
      port "tte_tag" is a bus, created as [65:0]
      port "tte_page_size_mask" is a bus, created as [2:0]
      port "tte_data" is a bus, created as [37:0]
      port "tlb_va" is a bus, created as [1:0]
      port "cache_ptag_w0" is a bus, created as [28:0]
      port "cache_ptag_w1" is a bus, created as [28:0]
      port "cache_ptag_w2" is a bus, created as [28:0]
      port "cache_ptag_w3" is a bus, created as [28:0]
      port "cache_set_vld" is a bus, created as [3:0]
      port "cache_way_hit" is a bus, created as [3:0]
      port "tlb_pgnum_crit" is a bus, created as [26:0]
      port "tlb_pgnum" is a bus, created as [26:0]
      port "tlb_tte_data" is a bus, created as [37:0]
      port "tlb_tte_tag" is a bus, created as [65:0]
Warning: Cell 'n2_irf_mp_128x72_cust.CEL' is created for undefined module 'n2_irf_mp_128x72_cust'. (MWNL-294)
      port "rd_tid" is a bus, created as [1:0]
      port "rd_addr_p0" is a bus, created as [4:0]
      port "rd_addr_p1" is a bus, created as [4:0]
      port "rd_addr_p2" is a bus, created as [4:0]
      port "wr_tid_p0" is a bus, created as [1:0]
      port "wr_tid_p1" is a bus, created as [1:0]
      port "wr_addr_p0" is a bus, created as [4:0]
      port "wr_addr_p1" is a bus, created as [4:0]
      port "wr_data_p0" is a bus, created as [71:0]
      port "wr_data_p1" is a bus, created as [71:0]
      port "save_tid" is a bus, created as [1:0]
      port "save_local_addr" is a bus, created as [2:0]
      port "save_even_addr" is a bus, created as [1:0]
      port "save_odd_addr" is a bus, created as [1:0]
      port "restore_tid" is a bus, created as [1:0]
      port "restore_local_addr" is a bus, created as [2:0]
      port "restore_even_addr" is a bus, created as [1:0]
      port "restore_odd_addr" is a bus, created as [1:0]
      port "save_global_tid" is a bus, created as [1:0]
      port "save_global_addr" is a bus, created as [1:0]
      port "restore_global_tid" is a bus, created as [1:0]
      port "restore_global_addr" is a bus, created as [1:0]
      port "dout_p0" is a bus, created as [71:0]
      port "dout_p1" is a bus, created as [71:0]
      port "dout_p2" is a bus, created as [71:0]
Warning: Cell 'n2_icd_sp_16p5kb_cust.CEL' is created for undefined module 'n2_icd_sp_16p5kb_cust'. (MWNL-294)
      port "red_en_in" is a bus, created as [1:0]
      port "red_d_in" is a bus, created as [4:0]
      port "rid_in" is a bus, created as [3:0]
      port "agd_ic_index_bf" is a bus, created as [8:0]
      port "agc_fill_wrway_bf" is a bus, created as [2:0]
      port "cmu_ic_data" is a bus, created as [263:0]
      port "agd_asi_bist_wrdata" is a bus, created as [32:0]
      port "itb_icd_waysel_c" is a bus, created as [7:0]
      port "agc_word_en_bf" is a bus, created as [7:0]
      port "icd_bus_0_instr_c" is a bus, created as [32:0]
      port "icd_bus_1_instr_c" is a bus, created as [32:0]
      port "icd_bus_2_instr_c" is a bus, created as [32:0]
      port "icd_bus_3_instr_c" is a bus, created as [32:0]
      port "red_d_out" is a bus, created as [4:0]
      port "red_en_out" is a bus, created as [1:0]
Warning: Cell 'n2_ict_sp_1920b_cust.CEL' is created for undefined module 'n2_ict_sp_1920b_cust'. (MWNL-294)
      port "agd_ic_index_bf" is a bus, created as [5:0]
      port "agc_fill_wrway_bf" is a bus, created as [2:0]
      port "agd_ict_wrtag_bf" is a bus, created as [29:0]
      port "ict_itlb_way_0_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_1_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_2_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_3_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_4_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_5_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_6_tag_f" is a bus, created as [29:0]
      port "ict_itlb_way_7_tag_f" is a bus, created as [29:0]
Warning: Cell 'n2_tlb_tl_64x59_cust.CEL' is created for undefined module 'n2_tlb_tl_64x59_cust'. (MWNL-294)
      port "tlb_rw_index" is a bus, created as [5:0]
      port "tte_tag" is a bus, created as [65:0]
      port "tte_page_size_mask" is a bus, created as [2:0]
      port "tte_data" is a bus, created as [37:0]
      port "tlb_va" is a bus, created as [1:0]
      port "cache_ptag_w0" is a bus, created as [28:0]
      port "cache_ptag_w1" is a bus, created as [28:0]
      port "cache_ptag_w2" is a bus, created as [28:0]
      port "cache_ptag_w3" is a bus, created as [28:0]
      port "cache_ptag_w4" is a bus, created as [28:0]
      port "cache_ptag_w5" is a bus, created as [28:0]
      port "cache_ptag_w6" is a bus, created as [28:0]
      port "cache_ptag_w7" is a bus, created as [28:0]
      port "cache_set_vld" is a bus, created as [7:0]
      port "cache_way_hit" is a bus, created as [7:0]
      port "tlb_pgnum" is a bus, created as [26:0]
      port "tlb_tte_data" is a bus, created as [37:0]
      port "tlb_tte_tag" is a bus, created as [65:0]

*****  Pass 2 Complete *****

*****   Verilog HDL translation completed! *****
 ------ Verilog Black Box Summary ------
 15 black boxes found. Use -verbose option for detail information.

 ------ Verilog Port Mismatch Summary ------
 0 port mismatches found. 
Elapsed =    0:00:09, CPU =    0:00:09
Hierarchy Preservation is turned ON
The quick-attach skip-search mode has been turned on.
  Start axu naming escaping style change ...
  End axu naming escaping style change, status is 1
Checking single pin net for cell 'spc.CEL' now...
Total number of cell instances: 213768
Total number of nets: 217165
Total number of ports: 477 (include 0 PG ports)
Total number of hierarchical cell instances: 37

The quick-attach skip-search mode has been turned off.
INFO:  total find 0 pg nets connected with tie net.
Elapsed =    0:00:06, CPU =    0:00:05
Information: Read verilog completed successfully.
1
icc_shell> import_fp_black_boxes [get_cells -hierarchical -filter "is_logical_black_box==true && black_box_type==Missing"]
Warning: A MIM group of plan groups has been detected which has no specified Master plan
 group.  The first plan group encountered will be used as the master plan group.
 Use select_mim_master_instance if you want to specify a particular plan group to be the MIM master plan group. (FPHDM-0059)
     plan group: tlu/tca
     plan group: mmu/scp0
     plan group: mmu/scp1
Committing MIM Master black box tlu/tca  (0x642802)
Creating Soft Macro cell n2_com_dp_32x72_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_com_dp_32x72_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance tlu/tca... Elapsed =    0:00:00, CPU =    0:00:00
Instance tlu/tca created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "tlu/tca"
Warning: No pin assignment constraints set for plan group tlu/tca (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box mmu/scp0  (0x642800)
Creating soft macro cell instance mmu/scp0... Elapsed =    0:00:00, CPU =    0:00:00
Instance mmu/scp0 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "mmu/scp0"
Warning: No pin assignment constraints set for plan group mmu/scp0 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box mmu/scp1  (0x642801)
Creating soft macro cell instance mmu/scp1... Elapsed =    0:00:00, CPU =    0:00:00
Instance mmu/scp1 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "mmu/scp1"
Warning: No pin assignment constraints set for plan group mmu/scp1 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 378 hier nets
Warning: A MIM group of plan groups has been detected which has no specified Master plan
 group.  The first plan group encountered will be used as the master plan group.
 Use select_mim_master_instance if you want to specify a particular plan group to be the MIM master plan group. (FPHDM-0059)
     plan group: tlu/tsa0
     plan group: tlu/tsa1
     plan group: lsu/cpq
Committing MIM Master black box tlu/tsa0  (0x642804)
Creating Soft Macro cell n2_com_dp_32x152_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_com_dp_32x152_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance tlu/tsa0... Elapsed =    0:00:00, CPU =    0:00:00
Instance tlu/tsa0 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "tlu/tsa0"
Warning: No pin assignment constraints set for plan group tlu/tsa0 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box tlu/tsa1  (0x642803)
Creating soft macro cell instance tlu/tsa1... Elapsed =    0:00:00, CPU =    0:00:00
Instance tlu/tsa1 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "tlu/tsa1"
Warning: No pin assignment constraints set for plan group tlu/tsa1 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box lsu/cpq  (0x642805)
Creating soft macro cell instance lsu/cpq... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/cpq created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/cpq"
Warning: No pin assignment constraints set for plan group lsu/cpq (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 909 hier nets
Warning: A MIM group of plan groups has been detected which has no specified Master plan
 group.  The first plan group encountered will be used as the master plan group.
 Use select_mim_master_instance if you want to specify a particular plan group to be the MIM master plan group. (FPHDM-0059)
     plan group: mmu/mra0
     plan group: mmu/mra1
Committing MIM Master black box mmu/mra0  (0x642807)
Creating Soft Macro cell n2_com_dp_32x84_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_com_dp_32x84_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance mmu/mra0... Elapsed =    0:00:00, CPU =    0:00:00
Instance mmu/mra0 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "mmu/mra0"
Warning: No pin assignment constraints set for plan group mmu/mra0 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box mmu/mra1  (0x642806)
Creating soft macro cell instance mmu/mra1... Elapsed =    0:00:00, CPU =    0:00:00
Instance mmu/mra1 created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "mmu/mra1"
Warning: No pin assignment constraints set for plan group mmu/mra1 (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 275 hier nets
Warning: A MIM group of plan groups has been detected which has no specified Master plan
 group.  The first plan group encountered will be used as the master plan group.
 Use select_mim_master_instance if you want to specify a particular plan group to be the MIM master plan group. (FPHDM-0059)
     plan group: lsu/lru
     plan group: lsu/dva
     plan group: ifu_ftu/ftu_icv_cust
Committing MIM Master black box lsu/lru  (0x642809)
Creating Soft Macro cell n2_dva_dp_32x32_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_dva_dp_32x32_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/lru... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/lru created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/lru"
Warning: No pin assignment constraints set for plan group lsu/lru (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box lsu/dva  (0x642808)
Creating soft macro cell instance lsu/dva... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/dva created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/dva"
Warning: No pin assignment constraints set for plan group lsu/dva (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committing MIM Non-Master black box ifu_ftu/ftu_icv_cust  (0x64280a)
Creating soft macro cell instance ifu_ftu/ftu_icv_cust... Elapsed =    0:00:00, CPU =    0:00:00
Warning: During commit of plan group ifu_ftu/ftu_icv_cust, it was detected that the plan group version of the block contained a port scan_out, but the generated soft macro version of the block did not.  This is likely a tool-error. See man page for this Error code. (AXU-0013)
Instance ifu_ftu/ftu_icv_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "ifu_ftu/ftu_icv_cust"
Warning: No pin assignment constraints set for plan group ifu_ftu/ftu_icv_cust (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 196 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell spu.... Elapsed =    0:00:00, CPU =    0:00:00
Cell spu created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance spu... Elapsed =    0:00:00, CPU =    0:00:00
Instance spu created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "spu"
Warning: No pin assignment constraints set for plan group spu (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 2 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_irf_mp_128x72_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_irf_mp_128x72_cust created. Elapsed =    0:00:01, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance exu1/irf... Elapsed =    0:00:00, CPU =    0:00:00
Instance exu1/irf created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "exu1/irf"
Warning: No pin assignment constraints set for plan group exu1/irf (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 408 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Processing MIM descendant black box exu0/irf
Creating soft macro cell instance exu0/irf... Elapsed =    0:00:00, CPU =    0:00:00
Instance exu0/irf created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "exu0/irf"
Warning: No pin assignment constraints set for plan group exu0/irf (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 408 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_icd_sp_16p5kb_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_icd_sp_16p5kb_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance ifu_ftu/ftu_icd_cust... Elapsed =    0:00:00, CPU =    0:00:00
Instance ifu_ftu/ftu_icd_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "ifu_ftu/ftu_icd_cust"
Warning: No pin assignment constraints set for plan group ifu_ftu/ftu_icd_cust (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 188 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:01, CPU =    0:00:00
Creating Soft Macro cell n2_ict_sp_1920b_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_ict_sp_1920b_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance ifu_ftu/ftu_ict_cust... Elapsed =    0:00:00, CPU =    0:00:00
Instance ifu_ftu/ftu_ict_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "ifu_ftu/ftu_ict_cust"
Warning: No pin assignment constraints set for plan group ifu_ftu/ftu_ict_cust (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 52 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_tlb_tl_64x59_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_tlb_tl_64x59_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance ifu_ftu/ftu_itb_cust... Elapsed =    0:00:00, CPU =    0:00:00
Instance ifu_ftu/ftu_itb_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "ifu_ftu/ftu_itb_cust"
Warning: No pin assignment constraints set for plan group ifu_ftu/ftu_itb_cust (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 489 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:01, CPU =    0:00:00
Creating Soft Macro cell n2_frf_mp_256x78_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_frf_mp_256x78_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance fgu/frf... Elapsed =    0:00:00, CPU =    0:00:00
Instance fgu/frf created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "fgu/frf"
Warning: No pin assignment constraints set for plan group fgu/frf (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 344 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_dta_sp_1920b_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_dta_sp_1920b_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/dta... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/dta created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/dta"
Warning: No pin assignment constraints set for plan group lsu/dta (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 47 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_stb_cm_64x45_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_stb_cm_64x45_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/stb_cam... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/stb_cam created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/stb_cam"
Warning: No pin assignment constraints set for plan group lsu/stb_cam (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 118 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:01, CPU =    0:00:00
Creating Soft Macro cell n2_tlb_tl_128x59_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_tlb_tl_128x59_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/tlb... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/tlb created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/tlb"
Warning: No pin assignment constraints set for plan group lsu/tlb (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 370 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:00, CPU =    0:00:00
Creating Soft Macro cell n2_com_dp_64x84_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_com_dp_64x84_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/stb_ram... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/stb_ram created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/stb_ram"
Warning: No pin assignment constraints set for plan group lsu/stb_ram (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 184 hier nets
Iterating on plan non-MIM plan groups to commit: Elapsed =    0:00:01, CPU =    0:00:00
Creating Soft Macro cell n2_dca_sp_9kb_cust.... Elapsed =    0:00:00, CPU =    0:00:00
Cell n2_dca_sp_9kb_cust created. Elapsed =    0:00:00, CPU =    0:00:00
Setting cell utilization: 1.0000 
Creating soft macro cell instance lsu/dca... Elapsed =    0:00:00, CPU =    0:00:00
Instance lsu/dca created. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box "lsu/dca"
Warning: No pin assignment constraints set for plan group lsu/dca (FPHDM-0065)
Commit for this plan group complete. Elapsed =    0:00:00, CPU =    0:00:00
Committed black box to soft macro 
Clean up 380 hier nets
1
icc_shell> source -echo -verbose $dv_root/design/sys/synopsys/script/pnr_bb_sizing.tcl
## Black box sizing for spc
estimate_fp_black_boxes -sm_size {40 40} -fixed_shape {spu}
1
estimate_fp_black_boxes -sm_size {80 80} -fixed_shape {ifu_ftu/ftu_itb_cust}
1
estimate_fp_black_boxes -sm_size {160 160} -fixed_shape {ifu_ftu/ftu_ict_cust}
1
estimate_fp_black_boxes -sm_size {400 400} -fixed_shape {ifu_ftu/ftu_icd_cust}
1
estimate_fp_black_boxes -sm_size {40 40} -fixed_shape {ifu_ftu/ftu_icv_cust}
1
estimate_fp_black_boxes -sm_size {150 150} -fixed_shape {exu0/irf}
1
estimate_fp_black_boxes -sm_size {150 150} -fixed_shape {exu1/irf}
1
estimate_fp_black_boxes -sm_size {120 120} -fixed_shape {fgu/frf}
1
estimate_fp_black_boxes -sm_size {40 120} -fixed_shape {mmu/mra0}
1
estimate_fp_black_boxes -sm_size {40 120} -fixed_shape {mmu/mra1}
1
estimate_fp_black_boxes -sm_size {40 80} -fixed_shape {mmu/scp0}
1
estimate_fp_black_boxes -sm_size {40 80} -fixed_shape {mmu/scp1}
1
estimate_fp_black_boxes -sm_size {280 280} -fixed_shape {lsu/dca}
1
estimate_fp_black_boxes -sm_size {160 160} -fixed_shape {lsu/dta}
1
estimate_fp_black_boxes -sm_size {80 120} -fixed_shape {lsu/stb_ram}
1
estimate_fp_black_boxes -sm_size {80 80} -fixed_shape {lsu/stb_cam}
1
estimate_fp_black_boxes -sm_size {160 80} -fixed_shape {lsu/tlb}
1
estimate_fp_black_boxes -sm_size {40 40} -fixed_shape {lsu/lru}
1
estimate_fp_black_boxes -sm_size {40 40} -fixed_shape {lsu/dva}
1
estimate_fp_black_boxes -sm_size {80 120} -fixed_shape {lsu/cpq}
1
estimate_fp_black_boxes -sm_size {80 120} -fixed_shape {tlu/tsa0}
1
estimate_fp_black_boxes -sm_size {80 120} -fixed_shape {tlu/tsa1}
1
estimate_fp_black_boxes -sm_size {40 80} -fixed_shape {tlu/tca}
1
1
icc_shell> uniquify_fp_mw_cel
Warning: Undo stack cleared by command 'uniquify_fp_mw_cel' (HDUEDIT-104)
1
icc_shell> read_sdc -version 1.9 ../sdc/spc.sdc
Loading db file '/cad/synopsys/icc/2011.09-SP1/libraries/syn/gtech.db'
Loading db file '/cad/synopsys/icc/2011.09-SP1/libraries/syn/standard.sldb'
Information: linking reference library : /scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Back_End/lef/tcbn28hpmbwp35_110a/milkyway/tsmc28. (PSYN-878)

  Linking design 'spc'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (14 designs)              spc.CEL, etc
  tcbn28hpmbwp35tt1v25c_ccs (library) /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a/tcbn28hpmbwp35tt1v25c_ccs.db
  n2_frf_mp_256x78_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_frf_mp_256x78_cust.db
  n2_com_dp_32x84_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x84_cust.db
  n2_com_dp_32x72_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x72_cust.db
  n2_dca_sp_9kb_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dca_sp_9kb_cust.db
  n2_dva_dp_32x32_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dva_dp_32x32_cust.db
  n2_com_dp_32x152_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x152_cust.db
  n2_stb_cm_64x45_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_stb_cm_64x45_cust.db
  n2_com_dp_64x84_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_64x84_cust.db
  n2_dta_sp_1920b_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dta_sp_1920b_cust.db
  n2_tlb_tl_128x59_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_128x59_cust.db
  n2_irf_mp_128x72_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_irf_mp_128x72_cust.db
  n2_icd_sp_16p5kb_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_icd_sp_16p5kb_cust.db
  n2_ict_sp_1920b_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_ict_sp_1920b_cust.db
  n2_tlb_tl_64x59_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_64x59_cust.db

Error: Can't find inout port 'agd_ic_index_bf[1]' on reference to 'n2_icd_sp_16p5kb_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_icd_sp_16p5kb_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'agd_ic_index_bf[4]' on reference to 'n2_ict_sp_1920b_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_ict_sp_1920b_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'tlb_va[1]' on reference to 'n2_tlb_tl_64x59_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_tlb_tl_64x59_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'cache_ptag_w1[9]' on reference to 'n2_tlb_tl_128x59_cust' in 'lsu'. (LINK-1)
Warning: Unable to resolve reference 'n2_tlb_tl_128x59_cust' in 'lsu'. (LINK-5)
Error: Can't find inout port 'dcache_rd_addr_e[2]' on reference to 'n2_dca_sp_9kb_cust' in 'lsu'. (LINK-1)
Warning: Unable to resolve reference 'n2_dca_sp_9kb_cust' in 'lsu'. (LINK-5)
Warning: Unable to resolve reference 'spu' in 'spc'. (LINK-5)
Load global CTS reference options from NID to stack
 Info: hierarchy_separator was changed to /

Reading SDC version 1.9...
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
Warning: Design 'spc' has '1' unresolved references. For more detailed information, use the "link" command. (UID-341)
 Info: hierarchy_separator was changed to /
1
icc_shell> link
  Linking design 'spc'
  Using the following designs and libraries:
  --------------------------------------------------------------------------
  * (14 designs)              spc.CEL, etc
  tcbn28hpmbwp35tt1v25c_ccs (library) /rsgs/scratch0/eccheng/libs/tsmc/package.2013.05.10/STD/TSMCHOME/digital/Front_End/timing_power_noise/CCS/tcbn28hpmbwp35_111a/tcbn28hpmbwp35tt1v25c_ccs.db
  n2_frf_mp_256x78_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_frf_mp_256x78_cust.db
  n2_com_dp_32x84_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x84_cust.db
  n2_com_dp_32x72_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x72_cust.db
  n2_dca_sp_9kb_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dca_sp_9kb_cust.db
  n2_dva_dp_32x32_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dva_dp_32x32_cust.db
  n2_com_dp_32x152_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_32x152_cust.db
  n2_stb_cm_64x45_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_stb_cm_64x45_cust.db
  n2_com_dp_64x84_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_com_dp_64x84_cust.db
  n2_dta_sp_1920b_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_dta_sp_1920b_cust.db
  n2_tlb_tl_128x59_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_128x59_cust.db
  n2_irf_mp_128x72_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_irf_mp_128x72_cust.db
  n2_icd_sp_16p5kb_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_icd_sp_16p5kb_cust.db
  n2_ict_sp_1920b_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_ict_sp_1920b_cust.db
  n2_tlb_tl_64x59_cust (library) /rsgs/file0/greatmd/david/abl/OST2/OST2.design/design/sys/iop/spc/synopsys/bb/qtm/n2_tlb_tl_64x59_cust.db

Error: Can't find inout port 'agd_ic_index_bf[1]' on reference to 'n2_icd_sp_16p5kb_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_icd_sp_16p5kb_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'agd_ic_index_bf[4]' on reference to 'n2_ict_sp_1920b_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_ict_sp_1920b_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'tlb_va[1]' on reference to 'n2_tlb_tl_64x59_cust' in 'ifu_ftu'. (LINK-1)
Warning: Unable to resolve reference 'n2_tlb_tl_64x59_cust' in 'ifu_ftu'. (LINK-5)
Error: Can't find inout port 'cache_ptag_w1[9]' on reference to 'n2_tlb_tl_128x59_cust' in 'lsu'. (LINK-1)
Warning: Unable to resolve reference 'n2_tlb_tl_128x59_cust' in 'lsu'. (LINK-5)
Error: Can't find inout port 'dcache_rd_addr_e[2]' on reference to 'n2_dca_sp_9kb_cust' in 'lsu'. (LINK-1)
Warning: Unable to resolve reference 'n2_dca_sp_9kb_cust' in 'lsu'. (LINK-5)
Warning: Unable to resolve reference 'spu' in 'spc'. (LINK-5)
0
icc_shell> exit

Thank you...

